app/views/cars/_car.json.jbuilder

SELECT  "makes".* FROM "makes" WHERE "makes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "parts".* FROM "parts" INNER JOIN "cars_parts" ON "parts"."id" = "cars_parts"."part_id" WHERE "cars_parts"."car_id" = ?  [["car_id", 1]]
---
json.extract! car, :id, :name, :vin, :make_id, :created_at, :updated_at
json.make Make.find_by_id(car.make.id).name
json.parts car.parts.map { |part| part.name }